nc: 80

backbone:
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, ELAN1, [64, 64, 32]]
  - [-1, 1, AConv, [128]]
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]]
  - [-1, 1, AConv, [192]]
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]]
  - [-1, 1, AConv, [256]]
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]]
  - [-1, 1, SPPELAN, [256, 128]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, Adapter, [448, 192]]
  - [-1, 1, FABlock, [192]]
  - [-1, 1, CBAM, [192]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, Adapter, [320, 128]]
  - [-1, 1, FABlock, [128]]
  - [-1, 1, CBAM, [128]]

  - [19, 1, SPDADown, [128]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 1, Adapter, [448, 192]]
  - [-1, 1, MyHGBlock, [192, 4, 3, 1]]

  - [23, 1, SPDADown, [192]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, Adapter, [640, 256]]
  - [-1, 1, ASPP, [256, [1, 6, 12]]]
  - [-1, 1, SPPF, [256, 5]]

  - [[19, 23, 28], 1, Detect, [nc]]
