nc: 80

backbone:
  - [-1, 1, EfficientNetBackbone, ["efficientnet_b3", True, [2, 3, 4]]]
  - [-1, 1, Adapter, [1280, 256]]
  - [-1, 1, FABlock, [256]]
  - [-1, 1, nn.Identity, []]
  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 1, FABlock, [384]]
  - [-1, 1, nn.Identity, []]
  - [-1, 1, Adapter, [512, 256]]
  - [-1, 1, nn.Identity, []]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 1, Adapter, [640, 384]]
  - [-1, 1, FABlock, [384]]
  - [-1, 1, nn.Identity, []]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, Adapter, [640, 256]]
  - [-1, 1, FABlock, [256]]
  - [-1, 1, nn.Identity, []]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 1, Adapter, [640, 384]]
  - [-1, 1, FABlock, [384]]
  - [-1, 1, nn.Identity, []]

  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 1, Adapter, [640, 512]]
  - [-1, 1, FABlock, [512]]
  - [-1, 1, nn.Identity, []]

  - [[17, 22, 27], 1, Concat, [1]]
  - [-1, 1, Adapter, [768, 512]]
  - [-1, 1, FABlock, [512]]
  - [-1, 1, nn.Identity, []]
  - [-1, 1, nn.Identity, []]

  - [-1, 1, nn.Identity, []]
  - [-1, 1, Adapter, [512, 256]]
  - [-1, 1, FABlock, [256]]
  - [-1, 1, nn.Identity, []]

  - [17, 1, Adapter, [256, 96]]
  - [21, 1, Adapter, [384, 160]]
  - [27, 1, Adapter, [512, 192]]

  - [[38, 39, 40], 1, Detect, [nc]]
