# 03_additive_hgblocks.yaml
# (Baseline + EfficientNet + FABlocks + MyHGBlocks)
# Parameters
nc: 80

# Backbone
backbone:
  - [-1, 1, EfficientNetBackbone, ["efficientnet_b3", True, [2, 3, 4]]] # 0

  # Transition & lightweight feature adapters
  - [-1, 1, Adapter, [1280, 256]] # 1
  - [-1, 1, FABlock, [256]] # 2
  - [-1, 1, MyHGBlock, [256, 256, 3, 1]] # 3 (ADDED, with channel fix)
  - [-1, 1, Conv, [384, 3, 2]] # 4 (Was SPDADown)
  - [-1, 1, FABlock, [384]] # 5
  - [-1, 1, MyHGBlock, [384, 384, 3, 1]] # 6 (ADDED, with channel fix)
  - [-1, 1, Adapter, [512, 256]] # 7
  - [-1, 1, nn.Identity, []] # 8 (Was DropBlock)
# ... (rest of the file is identical to 02_additive_fablocks.yaml) ...
# ------------------------------------------------------------------
# Neck / Top-down path (feature fusion + attention)
# ------------------------------------------------------------------
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 5], 1, Concat, [1]] # 10
  - [-1, 1, Adapter, [640, 384]] # 11
  - [-1, 1, FABlock, [384]] # 12
  - [-1, 1, nn.Identity, []] # 13 (Was CBAM)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 2], 1, Concat, [1]] # 15
  - [-1, 1, Adapter, [640, 256]] # 16
  - [-1, 1, FABlock, [256]] # 17
  - [-1, 1, nn.Identity, []] # 18 (Was CBAM)
  # ------------------------------------------------------------------
  # Bottom-up path (enhanced fusion)
  # ------------------------------------------------------------------
  - [-1, 1, Conv, [256, 3, 2]] # 19 (Was SPDADown)
  - [[-1, 11], 1, Concat, [1]] # 20
  - [-1, 1, Adapter, [640, 384]] # 21
  - [-1, 1, FABlock, [384]] # 22
  - [-1, 1, nn.Identity, []] # 23 (Was CBAM)
  - [-1, 1, Conv, [384, 3, 2]] # 24 (Was SPDADown)
  - [[-1, 7], 1, Concat, [1]] # 25
  - [-1, 1, Adapter, [640, 512]] # 26
  - [-1, 1, FABlock, [512]] # 27
  - [-1, 1, nn.Identity, []] # 28 (Was CBAM)
  # ------------------------------------------------------------------
  # BiFPN-style multi-scale fusion (fuse P3, P4, P5)
  # ------------------------------------------------------------------
  - [[17, 22, 27], 1, Concat, [1]] # 29
  - [-1, 1, Adapter, [768, 512]] # 30
  - [-1, 1, FABlock, [512]] # 31
  - [-1, 1, nn.Identity, []] # 32 (Was BiFPN)
  - [-1, 1, nn.Identity, []] # 33 (Was CBAM)
  # ------------------------------------------------------------------
  # ASPP + SPPF context modules (capture multi-scale context)
  # ------------------------------------------------------------------
  - [-1, 1, nn.Identity, []] # 34 (Was ASPP)
  - [-1, 1, Adapter, [512, 256]] # 35
  - [-1, 1, FABlock, [256]] # 36
  - [-1, 1, nn.Identity, []] # 37 (Was SPPF)
  # ------------------------------------------------------------------
  # Prepare detection heads (multi-scale adapters)
  # ------------------------------------------------------------------
  - [17, 1, Adapter, [256, 96]] # 38
  - [21, 1, Adapter, [384, 160]] # 39
  - [27, 1, Adapter, [512, 192]] # 40
  # ------------------------------------------------------------------
  # Detect head (expects 3 inputs: P3, P4, P5)
  # ------------------------------------------------------------------
  - [[38, 39, 40], 1, Detect, [nc]] # 41
